hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/block_dev/qspi/nrf_block_dev_qspi.c
static void qspi_handler(nrf_drv_qspi_evt_t event, void *p_context)
{
    if(m_active_qspi_dev != p_context)
        return;
        
    nrf_block_dev_qspi_t const *p_qspi_dev = p_context;
    nrf_block_dev_qspi_work_t   *p_work = p_qspi_dev->p_work;
    nrf_block_req_t *p_blk_left = &p_work->left_req;
    
    switch(p_work->state)
    {
        case NRF_BLOCK_DEV_QSPI_STATE_READ_EXEC:
        {
            if(p_work->writeback_mode)
                block_dev_qspi_read_from_eunit(p_qspi_dev);
                
            p_work->state = NRF_BLOCK_DEV_QSPI_STATE_IDLE;
            
            if(p_work->ev_handler)
            {
                const nrf_block_dev_event_t ev =
                {
                    NRF_BLOCK_DEV_EVT_BLK_READ_DONE,
                    NRF_BLOCK_DEV_RESULT_SUCCESS,
                    &p_work->req,
                    p_work->p_context
                };
                
                p_work->ev_handler(&p_qspi_dev->block_dev, &ev);
            }
            
            break;
        }
        
        case NRF_BLOCK_DEV_QSPI_STATE_EUNIT_LOAD:
        {
            ret_code_t ret;
            uint32_t erase_unit = BD_BLOCK_TO_ERASEUNIT(p_blk_left->blk_id,
                                                        p_work->geometry.blk_size);
            UNUSED_VARIABLE(erase_unit);
            ASSERT(erase_unit == p_work->erase_unit_idx);
            
            /* Check if block is in erase unit buffer*/
            ret = block_dev_qspi_eunit_write(p_qspi_dev, p_blk_left);
            ASSERT(ret == NRF_SUCCESS);
            UNUSED_VARIABLE(ret);
            break;
        }
        
        case NRF_BLOCK_DEV_QSPI_STATE_WRITE_ERASE:
        case NRF_BLOCK_DEV_QSPI_STATE_WRITE_EXEC:
        {
            /*Clear last programmed block*/
            uint32_t block_to_program = __CLZ(__RBIT(p_work->erase_unit_dirty_blocks));
            
            if(p_work->state == NRF_BLOCK_DEV_QSPI_STATE_WRITE_EXEC)
                p_work->erase_unit_dirty_blocks ^= 1u << block_to_program;
                
            if(p_work->erase_unit_dirty_blocks == 0)
            {
                if(p_work->left_req.blk_count)
                {
                    /*Load next erase unit*/
                    ret_code_t ret;
                    uint32_t eunit = BD_BLOCK_TO_ERASEUNIT(p_blk_left->blk_id,
                                                           p_work->geometry.blk_size);
                                                           
                    p_work->erase_unit_idx = eunit;
                    p_work->state = NRF_BLOCK_DEV_QSPI_STATE_EUNIT_LOAD;
                    
                    ret = nrf_drv_qspi_read(p_work->p_erase_unit_buff,
                                            NRF_BLOCK_DEV_QSPI_ERASE_UNIT_SIZE,
                                            p_work->erase_unit_idx *
                                            NRF_BLOCK_DEV_QSPI_ERASE_UNIT_SIZE);
                    UNUSED_VARIABLE(ret);
                    
                    break;
                }
                
                /*All blocks are programmed. Call event handler if required.*/
                p_work->state = NRF_BLOCK_DEV_QSPI_STATE_IDLE;
                
                if(p_work->ev_handler && !p_work->cache_flushing)
                {
                    const nrf_block_dev_event_t ev =
                    {
                        NRF_BLOCK_DEV_EVT_BLK_WRITE_DONE,
                        NRF_BLOCK_DEV_RESULT_SUCCESS,
                        &p_work->req,
                        p_work->p_context
                    };
                    
                    p_work->ev_handler(&p_qspi_dev->block_dev, &ev);
                }
                
                p_work->cache_flushing = false;
                break;
            }
            
            /*Get next block to program from program mask*/
            block_to_program = __CLZ(__RBIT(p_work->erase_unit_dirty_blocks));
            uint32_t dst_address = (p_work->erase_unit_idx * NRF_BLOCK_DEV_QSPI_ERASE_UNIT_SIZE) +
                                   (block_to_program * p_work->geometry.blk_size);
                                   
            const void *p_src_address = p_work->p_erase_unit_buff +
                                        block_to_program * p_work->geometry.blk_size;
                                        
            p_work->state = NRF_BLOCK_DEV_QSPI_STATE_WRITE_EXEC;
            ret_code_t ret = nrf_drv_qspi_write(p_src_address,
                                                p_work->geometry.blk_size,
                                                dst_address);
            UNUSED_VARIABLE(ret);
            break;
        }
        
        default:
            ASSERT(0);
            break;
    }
}

static void wait_for_idle(nrf_block_dev_qspi_t const *p_qspi_dev)
{
    nrf_block_dev_qspi_work_t *p_work = p_qspi_dev->p_work;
    
    while(p_work->state != NRF_BLOCK_DEV_QSPI_STATE_IDLE)
        __WFI();
}

static ret_code_t block_dev_qspi_init(nrf_block_dev_t const *p_blk_dev,
                                      nrf_block_dev_ev_handler ev_handler,
                                      void const *p_context)
{
    ASSERT(p_blk_dev);
    nrf_block_dev_qspi_t const   *p_qspi_dev =
        CONTAINER_OF(p_blk_dev, nrf_block_dev_qspi_t, block_dev);
    nrf_block_dev_qspi_work_t    *p_work = p_qspi_dev->p_work;
    nrf_drv_qspi_config_t const *p_qspi_cfg = &p_qspi_dev->qspi_bdev_config.qspi_config;
    
    ret_code_t ret = NRF_SUCCESS;
    
    NRF_LOG_INST_DEBUG(p_qspi_dev->p_log, "Init");
    
    if(p_qspi_dev->qspi_bdev_config.block_size % BD_PAGE_PROGRAM_SIZE)
    {
        /*Unsupported block size*/
        NRF_LOG_INST_ERROR(p_qspi_dev->p_log, "Unsupported block size because of program page size");
        return NRF_ERROR_NOT_SUPPORTED;
    }
    
    if(NRF_BLOCK_DEV_QSPI_ERASE_UNIT_SIZE % p_qspi_dev->qspi_bdev_config.block_size)
    {
        /*Unsupported block size*/
        NRF_LOG_INST_ERROR(p_qspi_dev->p_log, "Unsupported block size because of erase unit size");
        return NRF_ERROR_NOT_SUPPORTED;
    }
    
    if(m_active_qspi_dev)
    {
        /* QSPI instance is BUSY*/
        NRF_LOG_INST_ERROR(p_qspi_dev->p_log, "Cannot init because QSPI is busy");
        return NRF_ERROR_BUSY;
    }
    
    ret = nrf_drv_qspi_init(p_qspi_cfg, qspi_handler, (void *)p_blk_dev);
    
    if(ret != NRF_SUCCESS)
    {
        NRF_LOG_INST_ERROR(p_qspi_dev->p_log, "QSPI init error: %"PRIu32"", ret);
        return ret;
    }
    
