hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/block_dev/qspi/nrf_block_dev_qspi.c
static bool block_dev_qspi_update_eunit(nrf_block_dev_qspi_t const *p_qspi_dev,
                                        size_t off,
                                        const void *p_src,
                                        size_t len)
{
    ASSERT((len % sizeof(uint32_t)) == 0)
    nrf_block_dev_qspi_work_t   *p_work = p_qspi_dev->p_work;
    
    uint32_t        *p_dst32 = (uint32_t *)(p_work->p_erase_unit_buff + off);
    const uint32_t *p_src32 = p_src;
    
    bool erase_required = false;
    len /= sizeof(uint32_t);
    
    /*Do normal copying until erase unit is not required*/
    do
    {
        if(*p_dst32 != *p_src32)
        {
            if(*p_dst32 != BD_ERASE_UNIT_ERASE_VAL)
                erase_required = true;
                
            /*Mark block as dirty*/
            p_work->erase_unit_dirty_blocks |= 1u << (off / p_work->geometry.blk_size);
        }
        
        *p_dst32++ = *p_src32++;
        off += sizeof(uint32_t);
    } while(--len);
    
    return erase_required;
}

static ret_code_t block_dev_qspi_write_start(nrf_block_dev_qspi_t const *p_qspi_dev)
{
    nrf_block_dev_qspi_work_t   *p_work = p_qspi_dev->p_work;
    
    if(!p_work->erase_required)
    {
        /*Get first block to program from program mask*/
        uint32_t block_to_program = __CLZ(__RBIT(p_work->erase_unit_dirty_blocks));
        uint32_t dst_address = (p_work->erase_unit_idx * NRF_BLOCK_DEV_QSPI_ERASE_UNIT_SIZE) +
                               (block_to_program * p_work->geometry.blk_size);
                               
        const void *p_src_address = p_work->p_erase_unit_buff +
                                    block_to_program * p_work->geometry.blk_size;
                                    
        p_work->state = NRF_BLOCK_DEV_QSPI_STATE_WRITE_EXEC;
        return nrf_drv_qspi_write(p_src_address,
                                  p_work->geometry.blk_size,
                                  dst_address);
    }
    
    /*Erase is required*/
    uint32_t address = (p_work->erase_unit_idx * NRF_BLOCK_DEV_QSPI_ERASE_UNIT_SIZE);
    p_work->state = NRF_BLOCK_DEV_QSPI_STATE_WRITE_ERASE;
    p_work->erase_required = false;
    
    return nrf_drv_qspi_erase(NRF_QSPI_ERASE_LEN_4KB, address);
}

static ret_code_t block_dev_qspi_eunit_write(nrf_block_dev_qspi_t const *p_qspi_dev,
                                             nrf_block_req_t *p_blk_left)
{
    nrf_block_dev_qspi_work_t   *p_work = p_qspi_dev->p_work;
    
    size_t blk = p_blk_left->blk_id %
                 BD_BLOCKS_PER_ERASEUNIT(p_work->geometry.blk_size);
    size_t cnt = BD_BLOCKS_PER_ERASEUNIT(p_work->geometry.blk_size) - blk;
    size_t off = p_work->geometry.blk_size * blk;
    
    if(cnt > p_blk_left->blk_count)
        cnt = p_blk_left->blk_count;
        
    bool erase_required = block_dev_qspi_update_eunit(p_qspi_dev,
                                                      off,
                                                      p_blk_left->p_buff,
                                                      cnt * p_work->geometry.blk_size);
                                                      
    if(erase_required)
        p_work->erase_required = true;
        
    p_blk_left->blk_count -= cnt;
    p_blk_left->blk_id += cnt;
    p_blk_left->p_buff = (uint8_t *)p_blk_left->p_buff + cnt * p_work->geometry.blk_size;
    
    if(p_work->erase_required)
    {
        uint32_t blk_size = p_work->geometry.blk_size;
        p_work->erase_unit_dirty_blocks |= (1u << BD_BLOCKS_PER_ERASEUNIT(blk_size)) - 1;
    }
    
    if(p_work->erase_unit_dirty_blocks == 0 || p_work->writeback_mode)
    {
        /*No dirty blocks detected. Write end.*/
        if(p_work->ev_handler && p_blk_left->blk_count == 0)
        {
            const nrf_block_dev_event_t ev =
            {
                NRF_BLOCK_DEV_EVT_BLK_WRITE_DONE,
                NRF_BLOCK_DEV_RESULT_SUCCESS,
                &p_work->req,
                p_work->p_context
            };
            
            
            p_work->state = NRF_BLOCK_DEV_QSPI_STATE_IDLE;
            p_work->ev_handler(&p_qspi_dev->block_dev, &ev);
            return NRF_SUCCESS;
        }
    }
    
    return block_dev_qspi_write_start(p_qspi_dev);
}

static ret_code_t block_dev_qspi_write_req(nrf_block_dev_t const *p_blk_dev,
                                           nrf_block_req_t const *p_blk)
{
    ASSERT(p_blk_dev);
    ASSERT(p_blk);
    nrf_block_dev_qspi_t const *p_qspi_dev =
        CONTAINER_OF(p_blk_dev, nrf_block_dev_qspi_t, block_dev);
    nrf_block_dev_qspi_work_t   *p_work = p_qspi_dev->p_work;
    
    ret_code_t ret = NRF_SUCCESS;
    
    NRF_LOG_INST_DEBUG(
        p_qspi_dev->p_log,
        "Write req to block %"PRIu32" size %"PRIu32"(x%"PRIu32") from %"PRIXPTR,
        p_blk->blk_id,
        p_blk->blk_count,
        p_blk_dev->p_ops->geometry(p_blk_dev)->blk_size,
        p_blk->p_buff);
        
    if((p_blk->blk_id + p_blk->blk_count) > p_work->geometry.blk_count)
    {
        NRF_LOG_INST_ERROR(
            p_qspi_dev->p_log,
            "Out of range write req block %"PRIu32" count %"PRIu32" while max is %"PRIu32,
            p_blk->blk_id,
            p_blk->blk_count,
            p_blk_dev->p_ops->geometry(p_blk_dev)->blk_count);
        return NRF_ERROR_INVALID_ADDR;
    }
    
    if(m_active_qspi_dev != p_qspi_dev)
    {
        /* QSPI instance is BUSY*/
        NRF_LOG_INST_ERROR(p_qspi_dev->p_log, "Cannot write because QSPI is busy");
        return NRF_ERROR_BUSY;
    }
    
    if(p_work->state != NRF_BLOCK_DEV_QSPI_STATE_IDLE)
    {
        /* Previous asynchronous operation in progress*/
        NRF_LOG_INST_ERROR(p_qspi_dev->p_log, "Cannot write because of ongoing previous operation");
        return NRF_ERROR_BUSY;
    }
    
    p_work->left_req = *p_blk;
    p_work->req = *p_blk;
    
    nrf_block_req_t *p_blk_left = &p_work->left_req;
    
    uint32_t erase_unit = BD_BLOCK_TO_ERASEUNIT(p_blk_left->blk_id,
                                                p_work->geometry.blk_size);
                                                
    /* Check if block is in erase unit buffer*/
    if(erase_unit == p_work->erase_unit_idx)
        ret = block_dev_qspi_eunit_write(p_qspi_dev, p_blk_left);
        
    else
    {
        if(p_work->writeback_mode)
            ret = block_dev_qspi_write_start(p_qspi_dev);
            
        else
        {
            p_work->erase_unit_idx = erase_unit;
            p_work->state = NRF_BLOCK_DEV_QSPI_STATE_EUNIT_LOAD;
            
            ret = nrf_drv_qspi_read(p_work->p_erase_unit_buff,
                                    NRF_BLOCK_DEV_QSPI_ERASE_UNIT_SIZE,
                                    erase_unit * NRF_BLOCK_DEV_QSPI_ERASE_UNIT_SIZE);
        }
    }
    
    if(ret != NRF_SUCCESS)
    {
        NRF_LOG_INST_ERROR(p_qspi_dev->p_log, "QSPI write error: %"PRIu32"", ret);
        p_work->state = NRF_BLOCK_DEV_QSPI_STATE_IDLE;
        return ret;
    }
    
    if(!p_work->ev_handler && (p_work->state != NRF_BLOCK_DEV_QSPI_STATE_IDLE))
    {
        /*Synchronous operation*/
        wait_for_idle(p_qspi_dev);
    }
    
    return ret;
}

