hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/block_dev/qspi/nrf_block_dev_qspi.c
static ret_code_t block_dev_qspi_ioctl(nrf_block_dev_t const *p_blk_dev,
                                       nrf_block_dev_ioctl_req_t req,
                                       void *p_data)
{
    ASSERT(p_blk_dev);
    nrf_block_dev_qspi_t const *p_qspi_dev =
        CONTAINER_OF(p_blk_dev, nrf_block_dev_qspi_t, block_dev);
    nrf_block_dev_qspi_work_t   *p_work = p_qspi_dev->p_work;
    
    switch(req)
    {
        case NRF_BLOCK_DEV_IOCTL_REQ_CACHE_FLUSH:
        {
            bool *p_flushing = p_data;
            NRF_LOG_INST_DEBUG(p_qspi_dev->p_log, "IOCtl: Cache flush");
            
            if(p_work->state != NRF_BLOCK_DEV_QSPI_STATE_IDLE)
                return NRF_ERROR_BUSY;
                
            if(!p_work->writeback_mode || p_work->erase_unit_dirty_blocks == 0)
            {
                if(p_flushing)
                    *p_flushing = false;
                    
                return NRF_SUCCESS;
            }
            
            ret_code_t ret =  block_dev_qspi_write_start(p_qspi_dev);
            
            if(ret == NRF_SUCCESS)
            {
                if(p_flushing)
                    *p_flushing = true;
                    
                p_work->cache_flushing = true;
            }
            
            return ret;
        }
        
        case NRF_BLOCK_DEV_IOCTL_REQ_INFO_STRINGS:
        {
            if(p_data == NULL)
                return NRF_ERROR_INVALID_PARAM;
                
            nrf_block_dev_info_strings_t const * * pp_strings = p_data;
            *pp_strings = &p_qspi_dev->info_strings;
            return NRF_SUCCESS;
        }
        
        default:
            break;
    }
    
    return NRF_ERROR_NOT_SUPPORTED;
}

static nrf_block_dev_geometry_t const *block_dev_qspi_geometry(nrf_block_dev_t const *p_blk_dev)
{
    ASSERT(p_blk_dev);
    nrf_block_dev_qspi_t const *p_qspi_dev =
        CONTAINER_OF(p_blk_dev, nrf_block_dev_qspi_t, block_dev);
    nrf_block_dev_qspi_work_t const *p_work = p_qspi_dev->p_work;
    
    return &p_work->geometry;
}

const nrf_block_dev_ops_t nrf_block_device_qspi_ops =
{
    .init = block_dev_qspi_init,
    .uninit = block_dev_qspi_uninit,
    .read_req = block_dev_qspi_read_req,
    .write_req = block_dev_qspi_write_req,
    .ioctl = block_dev_qspi_ioctl,
    .geometry = block_dev_qspi_geometry,
};

/** @} */
#endif // NRF_MODULE_ENABLED(NRF_BLOCK_DEV_QSPI)
